const waypoints = [
  { "name": "43º 15' 00\", -2º 56' 18\"", "coords": [43.25, -2 - (56 / 60) - (18 / 3600)], "icon": "green_circle", "size": 2 },
  { "name": "43º 15' 01\", -2º 56' 08\"", "coords": [43.25 + (1 / 3600), -2 - (56 / 60) - (8 / 3600)], "icon": "green_circle", "size": 2 },
  { "name": "43º 15' 08\", -2º 56' 01\"", "coords": [43.25 + (8 / 3600), -2 - (56 / 60) - (1 / 3600)], "icon": "green_circle", "size": 2 },
  { "name": "43º 15' 08\", -2º 56' 10\"", "coords": [43.25 + (8 / 3600), -2 - (56 / 60) - (10 / 3600)], "icon": "green_circle", "size": 2 },
  { "name": "43º 15' 10\", -2º 56' 08\"", "coords": [43.25 + (10 / 3600), -2 - (56 / 60) - (8 / 3600)], "icon": "green_circle", "size": 2 },
  { "name": "43º 15' 18\", -2º 56' 00\"", "coords": [43.25 + (18 / 3600), -2 - (56 / 60)], "icon": "green_circle", "size": 2 }
];